<?php
//////////////////设备管理/////////////////////////////////////
$nas_types = array("0"=>"其它",
    "1"=>"华为、H3C、深澜网关",
    "14"=>"华为 AC",
    "25"=>"华为IPOE(COA)",
    "10"=>"H3C AC",
    "26"=>"H3C",
    //"2"=>"Juniper",
    "3"=>"思科 Cisco",
    "13"=>"Cisco ISG",
    "27"=>"Cisco ASR9K",
    "4"=>"Juniper-Portal(srun4k)",
    "11"=>"Juniper MX960(IPOE+PPPOE)",
    "23"=>"Juniper-AC",
    "5"=>"北电 Nortel",
    "6"=>"Aruba",
    "20"=>"Aruba(支持DM)",
    "7"=>"Redback",
    "8"=>"Borcade",
    "9"=>"RouterOs",
    //"12"=>"",
    "15"=>"中兴",
    "16"=>"Array VPN",
    "17"=>"华为TSM",
    //"18"=>"Juniper-AC-1X",
    //"19"=>"Juniper-MX960-1X",
    "21"=>"迪普",
    "22"=>"飞塔VPN",
    "24"=>"Altai AC",
    //"28"=>"",
);

$ac_types = array("cmcc"=>"中国移动(h3c v1.1)",
    "h3c"=>"华三,华为(h3c v1.2)",
    "datang"=>"大唐移动(cmcc v2.0)",
    "datang1"=>"大唐PAP",
    "ruijie"=>"锐捷(cmcc v2.0)",
    //"cisco"=>"思科(COA)",
    "cisco1"=>"思科(ASR)",
    "cisco2"=>"思科(ASR9K)",
    //"juniper"=>"juniper(COA)",
    "juniper1"=>"juniper(IPOE)",
    "aruba"=>"Aruba(xml)",
    //"aruba1"=>"Aruba(http)",
    //"huawei1"=>"华为IPOE(COA)",
    "srun"=>"深澜网关(radius-client)",
);
/*				  
$rad_types = array("cmcc"=>"中国移动radius", 
				   "cams"=>"Cams(标准radius)",
				   "juniper1"=>"Juniper-IPOE集群",
				   "h3c_info"=>"H3C上下线通知",
				   );
*/
////////////////////////////////////////////////////////////////

/////////////////////////自定义属性/////////////////////////////	
//发送条件			   
$attr_conditions = array( "0"=>"不发送",
    "1"=>"无条件发送",
    "2"=>"欠费用户发送",
    "3"=>"正常用户发送",
    "4"=>"无下行带宽值时发送",
    "5"=>"有下行带宽值时发送",
    "6"=>"无上行带宽值时发送",
    "7"=>"有上行带宽值时发送",
    "8"=>"MAC认证时发送",
    //"8"=>"无可用时长时发送",
    //"9"=>"有可用时长时发送",
    "10"=>"绑定IP时发送",
    "11"=>"Juniper-IPOE登录时发送(COA)",
    "12"=>"Juniper-IPOE登出时发送(COA)",
    "13"=>"UPDATE报文中返回可用量",
    "14"=>"控制策略在线切换时发送（COA)",
);
//可变值
$attr_variables =  array("-1"=>"无(使用固定值)",
    "0"=>"上行带宽",
    "1"=>"下行带宽",
    "2"=>"可用时长",
    "3"=>"可用流量",
    "4"=>"登录类型",
    "5"=>"组ID",
    "6"=>"绑定的IP地址",
    "7"=>"手机号",
    "8"=>"NAS IP",
    "9"=>"VLAN ID",
);
//////////////////////////////////////////////////////////////////

//////////////////错误信息////////////////////////////////////////
$err_msgs = array("E3001"=>"流量或时长已用尽",
    "E3002"=>"计费策略条件不匹配",
    "E3003"=>"控制策略条件不匹配",
    "E3004"=>"余额不足",
    "E3005"=>"在线变更计费策略",
    "E3006"=>"在线变更控制策略",
    "E3007"=>"超时",
    "E3101"=>"心跳包超时",
    "E4001"=>"Radius表DM下线",
    "E4002"=>"DHCP表DM下线",
    "E4003"=>"Juniper IPOE COA上线",
    "E4004"=>"Juniper IPOE COA下线",
    "E4005"=>"proxy表DM下线",
    "E4006"=>"COA在线更改带宽",
    "E4007"=>"本地下线",
    "E4008"=>"虚拟下线",
    "E2531"=>"用户不存在",
    "E2532"=>"两次认证的间隔太短",
    "E2533"=>"尝试次数过于频繁",
    "E2553"=>"密码错误",
    "E2601"=>"不是专用客户端",
    "E2606"=>"用户被禁用",
    "E2611"=>"MAC绑定错误",
    "E2613"=>"NAS PORT绑定错误",
    "E2614"=>"VLAN ID绑定错误",
    "E2615"=>"IP绑定错误",
    "E2616"=>"已欠费",
    "E2620"=>"已经在线了",
    "E2806"=>"找不到符合条件的产品",
    "E2807"=>"找不到符合条件的计费策略",
    "E2808"=>"找不到符合条件的控制策略",
    "E2833"=>"IP地址异常，请重新拿地址",
    "E5990"=>"数据不完整",
    "E5991"=>"无效的参数",
    "E5992"=>"找不到这个用户",
    "E5993"=>"用户已存在",
    "E5001"=>"用户创建成功",
    "E5002"=>"用户创建失败",
    "E5010"=>"修改用户成功",
    "E5011"=>"修改用户失败",
    "E5020"=>"修改用户成功",
    "E5021"=>"修改用户失败",
    "E5030"=>"转组成功",
    "E5031"=>"转组失败",
    "E5040"=>"购买套餐成功",
    "E5041"=>"购买套餐失败",
    "E5042"=>"找不到套餐",
    "E5050"=>"绑定MAC认证成功",
    "E5051"=>"解绑MAC认证成功",
    "E5052"=>"绑定MAC成功",
    "E5053"=>"解绑MAC成功",
    "E5054"=>"绑定nas port成功",
    "E5055"=>"解绑nas port成功",
    "E5056"=>"绑定vlan id成功",
    "E5057"=>"解绑vlan id成功",
    "E5058"=>"绑定ip成功",
    "E5059"=>"解绑ip成功",
    "E6001"=>"用户缴费成功",
    "E6002"=>"用户缴费失败",
    //锐捷SAM返回的错误信息
    "sam_err:30001"=>"用户不存在，请重新输入",
    "sam_err:30002"=>"密码不正确，请重新输入",
    "sam_err:30003"=>"用户处于暂停状态，不能认证",
    "sam_err:30004"=>"用户已注销，不能认证",
    "sam_err:30005"=>"用户处于黑名单中，不能认证",
    "sam_err:30006"=>"用户已透支，不能认证",
    "sam_err:30007"=>"用户已欠费，不能认证",
);
///////////////////////////////////////////////////////////////

///////////计费模式///////////////////////////////////////////
$billing_modes = array("0"=>"实时计费",
    "1"=>"后付费",
    "2"=>"预付费",
    "3"=>"流量套餐",
    "4"=>"时长套餐",
);
////////////////////////////////////////////////////////////////

/////////////////////服务器类型///////////////////////////////////
$server_types = array("all"=>"仅此一台",
    "aaa"=>"RADIUS服务器",
    "portal"=>"Portal服务器",
    "redis_master"=>"主REDIS服务器",
    "redis_slave"=>"备REDIS服务器",
    "admin"=>"管理机",
    "distribute"=>"从网关",
    "httplog"=>"HTTP日志",
);
//////////////////////////////////////////////////////////////////////					  

/////////////////////条件//////////////////////////////////////////////					  
$conditions	= array("zone_set_id"=>"区域集合",
    "timer_set_id"=>"时间集合",
    "user_ip"=>"用户IP地址",
    "nas_ip"=>"NAS IP",
    "vlan_id"=>"双层VLAN-ID",
    "vlan_id1"=>"外层VLAN-ID",
    "time"=>"时间（时:分）",
    "day"=>"日期（月-日）",
    "week"=>"星期",
    "ip_type"=>"IP类型（V4V6）",
    "login_mode"=>"登录模式（有线无线）",
    "line_type"=>"出口线路",
    "client_type"=>"终端类型",
    "sum_bytes"=>"已用流量",
    "sum_seconds"=>"已用时长",
    "domain"=>"域名",
    "user_charge"=>"已消费的金额",
    "arrears"=>"是否欠费",
);
/////////////////////////////////////////////////////////////////////

///////////////////第三方接口////////////////////////////////////////
$third_partys = array("distribute"=>"分布式网关接口",
    "httplog"=>"httplog接口",
    "wangkang"=>"网康接口",
    "shenxinfu"=>"深信服接口",
    "rentianxing"=>"任天行接口",
    "stoneos"=>"山石防火墙接口",
    "allot"=>"Allot(radius)接口",
    "h3c"=>"H3C防火墙接口",
    "online2db"=>"在线表写入接口",
    "wireless_city"=>"运营商接口",
    "proxy"=>"代理接口"
);
/////////////////////////////////////////////////////////////////////

///////////////////////第三方认证接口///////////////////////////////
$third_auths = array("0"=>"按规则选择",
    "1"=>"LDAP",
    "2"=>"ESMTP(邮件协议)",
    "3"=>"Webservice(无线城市运营商)",
    "4"=>"Webservice(锐捷SAM)",
    "5"=>"代理接口"
);

///////////////////////////////////////////////////////////////////	

///////////////代理属性//////////////////////////////////////////////
$proxy_attrs = array("1"=>"用户名前缀",
    "2"=>"用户名关键词",
    "3"=>"绑定手机号",
    "4"=>"绑定移动手机号",
    "5"=>"绑定联通手机号",
    "6"=>"绑定电信手机号",
    "7"=>"计费组ID");
/////////////////////////////////////////////////////////////////////
/////////////下线原因/////////////////////////////////////////////////
$drop_reasons = array(
    "0"=>"正常",
    "3001"=>"流量超支",
    "3002"=>"计费策略不符",
    "3003"=>"控制策略不符",
    "3004"=>"余额不足",
    "3005"=>"计费策略在线切换",
);

/////////////////////////////////////////////////////////////////////			  
?>